<a href="https://colab.research.google.com/github/eyv7jz/ds1002-eyv7jz/blob/main/21-dataframes-in-r-student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Frames in R

Build a data frame by hand.

In [1]:
album <- c("The Low End Theory", "Nevermind", "Port of Morrow",
           "Dark Side of the Moon", "Naked", "OK Computer",
           "Abbey Road", "Thriller", "Rumours", "The Joshua Tree")
year <- c(1991, 1991, 2012, 1973, 1988, 1997, 1969, 1982, 1977, 1987)
digital <- c(FALSE, FALSE, TRUE, FALSE, TRUE, TRUE, FALSE, FALSE, FALSE, TRUE)

df <- data.frame(Album = album, Year = year, Digital = digital)

In [2]:
# display the df
df

   Album                 Year Digital
1  The Low End Theory    1991 FALSE
2  Nevermind             1991 FALSE
3  Port of Morrow        2012  TRUE
4  Dark Side of the Moon 1973 FALSE
5  Naked                 1988  TRUE
6  OK Computer           1997  TRUE
7  Abbey Road            1969 FALSE
8  Thriller              1982 FALSE
9  Rumours               1977 FALSE
10 The Joshua Tree       1987  TRUE

## Column Naming
We can also name the columns of a data frame, whether we imported oe built it by hand:

In [3]:
df <- data.frame(Album = album, Year = year, Digital = digital)

In [4]:
names(df) <- c("Album", "Year", "Digital")

## Insert a Column
Data can always be added or removed from a data frame after its creation.

In [5]:
df$Year

 [1] 1991 1991 2012 1973 1988 1997 1969 1982 1977 1987

In [6]:
df$Artist <- c("A Tribe Called Quest", "Nirvana", "The Shins", "Pink Floyd", "Talking Heads", "Radiohead", "The Beatles", "Michael Jackson", "Fleetwood Mac", "U2")

In [7]:
df

   Album                 Year Digital Artist
1  The Low End Theory    1991 FALSE   A Tribe Called Quest
2  Nevermind             1991 FALSE   Nirvana
3  Port of Morrow        2012  TRUE   The Shins
4  Dark Side of the Moon 1973 FALSE   Pink Floyd
5  Naked                 1988  TRUE   Talking Heads
6  OK Computer           1997  TRUE   Radiohead
7  Abbey Road            1969 FALSE   The Beatles
8  Thriller              1982 FALSE   Michael Jackson
9  Rumours               1977 FALSE   Fleetwood Mac
10 The Joshua Tree       1987  TRUE   U2

## Get the Structure
To fetch the structure of a data frame use str(). This tells us how many observations (rows) ir contains along with how many variables (columns) each obseravtion contains.
The output looks much like a list. Ths shouldn't be surprising since the dataframe can contain mixed data types. However, each column of variables must be of the same data type. (Names are all strings, Years are all numbers, and Vinyl is all bools/logicals.)

In [8]:
str(df)

'data.frame':	10 obs. of  4 variables:
 $ Album  : chr  "The Low End Theory" "Nevermind" "Port of Morrow" "Dark Side of the Moon" ...
 $ Year   : num  1991 1991 2012 1973 1988 ...
 $ Digital: logi  FALSE FALSE TRUE FALSE TRUE TRUE ...
 $ Artist : chr  "A Tribe Called Quest" "Nirvana" "The Shins" "Pink Floyd" ...

## Selecting Columns
Simply indicate the indexes for the rows tou want in the second half of the slice brackets `[ ]`. This can be a range separated by a colon`:`.

In [ ]:
# I believe this is how the function is setup??
df[ROWS, COLUMNS]

In [9]:
df[ ,1:2]

   Album                 Year
1  The Low End Theory    1991
2  Nevermind             1991
3  Port of Morrow        2012
4  Dark Side of the Moon 1973
5  Naked                 1988
6  OK Computer           1997
7  Abbey Road            1969
8  Thriller              1982
9  Rumours               1977
10 The Joshua Tree       1987

In [10]:
df[1:5,]

  Album                 Year Digital Artist
1 The Low End Theory    1991 FALSE   A Tribe Called Quest
2 Nevermind             1991 FALSE   Nirvana
3 Port of Morrow        2012  TRUE   The Shins
4 Dark Side of the Moon 1973 FALSE   Pink Floyd
5 Naked                 1988  TRUE   Talking Heads

In [11]:
df[,]

   Album                 Year Digital Artist
1  The Low End Theory    1991 FALSE   A Tribe Called Quest
2  Nevermind             1991 FALSE   Nirvana
3  Port of Morrow        2012  TRUE   The Shins
4  Dark Side of the Moon 1973 FALSE   Pink Floyd
5  Naked                 1988  TRUE   Talking Heads
6  OK Computer           1997  TRUE   Radiohead
7  Abbey Road            1969 FALSE   The Beatles
8  Thriller              1982 FALSE   Michael Jackson
9  Rumours               1977 FALSE   Fleetwood Mac
10 The Joshua Tree       1987  TRUE   U2

In [12]:
df[ , c(1,4)]

   Album                 Artist
1  The Low End Theory    A Tribe Called Quest
2  Nevermind             Nirvana
3  Port of Morrow        The Shins
4  Dark Side of the Moon Pink Floyd
5  Naked                 Talking Heads
6  OK Computer           Radiohead
7  Abbey Road            The Beatles
8  Thriller              Michael Jackson
9  Rumours               Fleetwood Mac
10 The Joshua Tree       U2

In [13]:
df[6,4]

[1] "Radiohead"

In [14]:
df[ , -(2:3)]

   Album                 Artist
1  The Low End Theory    A Tribe Called Quest
2  Nevermind             Nirvana
3  Port of Morrow        The Shins
4  Dark Side of the Moon Pink Floyd
5  Naked                 Talking Heads
6  OK Computer           Radiohead
7  Abbey Road            The Beatles
8  Thriller              Michael Jackson
9  Rumours               Fleetwood Mac
10 The Joshua Tree       U2

## Slicing & Filtering

Indicate the indexes of the row you want, appended with a comma and empty value for a column specification. This can be the first half of the slice brackets `[ ]`.

The command below asks for all columns of records 1-3:

In [15]:
df

   Album                 Year Digital Artist
1  The Low End Theory    1991 FALSE   A Tribe Called Quest
2  Nevermind             1991 FALSE   Nirvana
3  Port of Morrow        2012  TRUE   The Shins
4  Dark Side of the Moon 1973 FALSE   Pink Floyd
5  Naked                 1988  TRUE   Talking Heads
6  OK Computer           1997  TRUE   Radiohead
7  Abbey Road            1969 FALSE   The Beatles
8  Thriller              1982 FALSE   Michael Jackson
9  Rumours               1977 FALSE   Fleetwood Mac
10 The Joshua Tree       1987  TRUE   U2

In [16]:
df[ c(1,9,4,5) , c(4,2)]

  Artist               Year
1 A Tribe Called Quest 1991
9 Fleetwood Mac        1977
4 Pink Floyd           1973
5 Talking Heads        1988

In [17]:
df[1:3,]

  Album              Year Digital Artist
1 The Low End Theory 1991 FALSE   A Tribe Called Quest
2 Nevermind          1991 FALSE   Nirvana
3 Port of Morrow     2012  TRUE   The Shins

Select specific rows by combining them into the first half of the slice bracket `[ ]`.

In [18]:
df[c(1,3,4),]

  Album                 Year Digital Artist
1 The Low End Theory    1991 FALSE   A Tribe Called Quest
3 Port of Morrow        2012  TRUE   The Shins
4 Dark Side of the Moon 1973 FALSE   Pink Floyd

In [19]:
df[ , c("Album", "Artist")]

   Album                 Artist
1  The Low End Theory    A Tribe Called Quest
2  Nevermind             Nirvana
3  Port of Morrow        The Shins
4  Dark Side of the Moon Pink Floyd
5  Naked                 Talking Heads
6  OK Computer           Radiohead
7  Abbey Road            The Beatles
8  Thriller              Michael Jackson
9  Rumours               Fleetwood Mac
10 The Joshua Tree       U2

Select specific rows based on filter. Here we **query** the data frame for all albums with a FALSE value for the vinyl column.

In [20]:
df

   Album                 Year Digital Artist
1  The Low End Theory    1991 FALSE   A Tribe Called Quest
2  Nevermind             1991 FALSE   Nirvana
3  Port of Morrow        2012  TRUE   The Shins
4  Dark Side of the Moon 1973 FALSE   Pink Floyd
5  Naked                 1988  TRUE   Talking Heads
6  OK Computer           1997  TRUE   Radiohead
7  Abbey Road            1969 FALSE   The Beatles
8  Thriller              1982 FALSE   Michael Jackson
9  Rumours               1977 FALSE   Fleetwood Mac
10 The Joshua Tree       1987  TRUE   U2

In [21]:
df[df$Digital == FALSE,]

  Album                 Year Digital Artist
1 The Low End Theory    1991 FALSE   A Tribe Called Quest
2 Nevermind             1991 FALSE   Nirvana
4 Dark Side of the Moon 1973 FALSE   Pink Floyd
7 Abbey Road            1969 FALSE   The Beatles
8 Thriller              1982 FALSE   Michael Jackson
9 Rumours               1977 FALSE   Fleetwood Mac

In [22]:
df[df$Digital == TRUE,]

   Album           Year Digital Artist
3  Port of Morrow  2012 TRUE    The Shins
5  Naked           1988 TRUE    Talking Heads
6  OK Computer     1997 TRUE    Radiohead
10 The Joshua Tree 1987 TRUE    U2

In [23]:
df[df$Digital != FALSE,]

   Album           Year Digital Artist
3  Port of Morrow  2012 TRUE    The Shins
5  Naked           1988 TRUE    Talking Heads
6  OK Computer     1997 TRUE    Radiohead
10 The Joshua Tree 1987 TRUE    U2

In [24]:
df[df$Year > 1990,]

  Album              Year Digital Artist
1 The Low End Theory 1991 FALSE   A Tribe Called Quest
2 Nevermind          1991 FALSE   Nirvana
3 Port of Morrow     2012  TRUE   The Shins
6 OK Computer        1997  TRUE   Radiohead

In [25]:
# Or combine operators to filter more carefully. All comparison operators can be used
# ( ==, !=, <, >, <=, <= )
#
# as well as all logical operators
#   - AND: &
#   -  OR: |
#   - NOT: !

df[df$Year > 1990 & df$Digital == FALSE,]

  Album              Year Digital Artist
1 The Low End Theory 1991 FALSE   A Tribe Called Quest
2 Nevermind          1991 FALSE   Nirvana

In [26]:
df[df$Year > 1990 | df$Digital == FALSE,]

  Album                 Year Digital Artist
1 The Low End Theory    1991 FALSE   A Tribe Called Quest
2 Nevermind             1991 FALSE   Nirvana
3 Port of Morrow        2012  TRUE   The Shins
4 Dark Side of the Moon 1973 FALSE   Pink Floyd
6 OK Computer           1997  TRUE   Radiohead
7 Abbey Road            1969 FALSE   The Beatles
8 Thriller              1982 FALSE   Michael Jackson
9 Rumours               1977 FALSE   Fleetwood Mac

## Sorting

In [27]:
df_by_year <- df[order(df$Year),]
df_by_year

   Album                 Year Digital Artist
7  Abbey Road            1969 FALSE   The Beatles
4  Dark Side of the Moon 1973 FALSE   Pink Floyd
9  Rumours               1977 FALSE   Fleetwood Mac
8  Thriller              1982 FALSE   Michael Jackson
10 The Joshua Tree       1987  TRUE   U2
5  Naked                 1988  TRUE   Talking Heads
1  The Low End Theory    1991 FALSE   A Tribe Called Quest
2  Nevermind             1991 FALSE   Nirvana
6  OK Computer           1997  TRUE   Radiohead
3  Port of Morrow        2012  TRUE   The Shins

## `tidyverse`
All of the above operations -- selecting, querying, filtering, sorting -- are also possible (more easily) using methods built into the `tidyverse` library.

Import that and then we will review those operations.

```
Understand the PIPE in tidyverse: %>%
```

In [29]:
# Installing packages
install.packages("tidyverse")
library(tidyverse)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [ ]:
# Loading a library    -- I guess I'm not supposed to run this??
%>% = piping

In [30]:
# Piping
df %>%
  select(Album, Year) %>%
  filter(Year > 1990)

  Album              Year
1 The Low End Theory 1991
2 Nevermind          1991
3 Port of Morrow     2012
4 OK Computer        1997

## Import CSV Data

Just as with Pandas in Python, it is much more common to load data from files, such as CSV. This is possible manually, as well as by using the `tidyverse` library.

### Import a CSV Manually

R has a native `read.csv()` method. A few things to note as you run this cell:

- This method automatically creates a data frame from the CSV data.
- The file can be local or remote via URL.
- Since the data file has a header row, names are automatically assigned to columns.

In [31]:
# Loading a CSV file into a data frame
titanic <- read.csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
titanic

    PassengerId Survived Pclass
1    1          0        3
2    2          1        1
3    3          1        3
4    4          1        1
5    5          0        3
6    6          0        3
7    7          0        1
8    8          0        3
9    9          1        3
10  10          1        2
11  11          1        3
12  12          1        1
13  13          0        3
14  14          0        3
15  15          0        3
16  16          1        2
17  17          0        3
18  18          1        2
19  19          0        3
20  20          1        3
21  21          0        2
22  22          1        2
23  23          1        3
24  24          1        1
25  25          0        3
26  26          1        3
27  27          0        3
28  28          0        1
29  29          1        3
30  30          0        3
⋮   ⋮           ⋮        ⋮
862 862         0        2
863 863         1        1
864 864         0        3
865 865         0        2
866 866         1        2
867 867         1        2
868 868         0        1
869 869         0        3
870 870         1        3
871 871         0        3
872 872         1        1
873 873         0        1
874 874         0        3
875 875         1        2
876 876         1        3
877 877         0        3
878 878         0        3
879 879         0        3
880 880         1        1
881 881         1        2
882 882         0        3
883 883         0        3
884 884         0        2
885 885         0        3
886 886         0        3
887 887         0        2
888 888         1        1
889 889         0        3
890 890         1        1
891 891         0        3
    Name                                                      Sex    Age SibSp
1   Braund, Mr. Owen Harris                                   male   22  1
2   Cumings, Mrs. John Bradley (Florence Briggs Thayer)       female 38  1
3   Heikkinen, Miss. Laina                                    female 26  0
4   Futrelle, Mrs. Jacques Heath (Lily May Peel)              female 35  1
5   Allen, Mr. William Henry                                  male   35  0
6   Moran, Mr. James                                          male   NA  0
7   McCarthy, Mr. Timothy J                                   male   54  0
8   Palsson, Master. Gosta Leonard                            male    2  3
9   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)         female 27  0
10  Nasser, Mrs. Nicholas (Adele Achem)                       female 14  1
11  Sandstrom, Miss. Marguerite Rut                           female  4  1
12  Bonnell, Miss. Elizabeth                                  female 58  0
13  Saundercock, Mr. William Henry                            male   20  0
14  Andersson, Mr. Anders Johan                               male   39  1
15  Vestrom, Miss. Hulda Amanda Adolfina                      female 14  0
16  Hewlett, Mrs. (Mary D Kingcome)                           female 55  0
17  Rice, Master. Eugene                                      male    2  4
18  Williams, Mr. Charles Eugene                              male   NA  0
19  Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)   female 31  1
20  Masselmani, Mrs. Fatima                                   female NA  0
21  Fynney, Mr. Joseph J                                      male   35  0
22  Beesley, Mr. Lawrence                                     male   34  0
23  McGowan, Miss. Anna "Annie"                               female 15  0
24  Sloper, Mr. William Thompson                              male   28  0
25  Palsson, Miss. Torborg Danira                             female  8  3
26  Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson) female 38  1
27  Emir, Mr. Farred Chehab                                   male   NA  0
28  Fortune, Mr. Charles Alexander                            male   19  3
29  O'Dwyer, Miss. Ellen "Nellie"                             female NA  0
30  Todoroff, Mr. Lalio                                       male   NA  0
⋮   ⋮                                                         ⋮      ⋮   ⋮
862 Giles, Mr. Frederick Edward                               male   21  1
863 Swift, Mrs. Frederick Joel (Margaret Welles Barron)       female 48  0
864 Sage, Miss. Dorothy Edith "Dolly"                         female NA  8
865 Gill, Mr. John William                                    male   24  0
866 Bystrom, Mrs. (Karolina)                                  female 42  0
867 Duran y More, Miss. Asuncion                              female 27  1
868 Roebling, Mr. Washington Augustus II                      male   31  0
869 van Melkebeke, Mr. Philemon                               male   NA  0
870 Johnson, Master. Harold Theodor                           male    4  1
871 Balkic, Mr. Cerin                                         male   26  0
872 Beckwith, Mrs. Richard Leonard (Sallie Monypeny)          female 47  1
873 Carlsson, Mr. Frans Olof                                  male   33  0
874 Vander Cruyssen, Mr. Victor                               male   47  0
875 Abelson, Mrs. Samuel (Hannah Wizosky)                     female 28  1
876 Najib, Miss. Adele Kiamie "Jane"                          female 15  0
877 Gustafsson, Mr. Alfred Ossian                             male   20  0
878 Petroff, Mr. Nedelio                                      male   19  0
879 Laleff, Mr. Kristo                                        male   NA  0
880 Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)             female 56  0
881 Shelley, Mrs. William (Imanita Parrish Hall)              female 25  0
882 Markun, Mr. Johann                                        male   33  0
883 Dahlberg, Miss. Gerda Ulrika                              female 22  0
884 Banfield, Mr. Frederick James                             male   28  0
885 Sutehall, Mr. Henry Jr                                    male   25  0
886 Rice, Mrs. William (Margaret Norton)                      female 39  0
887 Montvila, Rev. Juozas                                     male   27  0
888 Graham, Miss. Margaret Edith                              female 19  0
889 Johnston, Miss. Catherine Helen "Carrie"                  female NA  1
890 Behr, Mr. Karl Howell                                     male   26  0
891 Dooley, Mr. Patrick                                       male   32  0
    Parch Ticket           Fare     Cabin       Embarked
1   0     A/5 21171          7.2500             S
2   0     PC 17599          71.2833 C85         C
3   0     STON/O2. 3101282   7.9250             S
4   0     113803            53.1000 C123        S
5   0     373450             8.0500             S
6   0     330877             8.4583             Q
7   0     17463             51.8625 E46         S
8   1     349909            21.0750             S
9   2     347742            11.1333             S
10  0     237736            30.0708             C
11  1     PP 9549           16.7000 G6          S
12  0     113783            26.5500 C103        S
13  0     A/5. 2151          8.0500             S
14  5     347082            31.2750             S
15  0     350406             7.8542             S
16  0     248706            16.0000             S
17  1     382652            29.1250             Q
18  0     244373            13.0000             S
19  0     345763            18.0000             S
20  0     2649               7.2250             C
21  0     239865            26.0000             S
22  0     248698            13.0000 D56         S
23  0     330923             8.0292             Q
24  0     113788            35.5000 A6          S
25  1     349909            21.0750             S
26  5     347077            31.3875             S
27  0     2631               7.2250             C
28  2     19950            263.0000 C23 C25 C27 S
29  0     330959             7.8792             Q
30  0     349216             7.8958             S
⋮   ⋮     ⋮                ⋮        ⋮           ⋮
862 0     28134            11.5000              S
863 0     17466            25.9292  D17         S
864 2     CA. 2343         69.5500              S
865 0     233866           13.0000              S
866 0     236852           13.0000              S
867 0     SC/PARIS 2149    13.8583              C
868 0     PC 17590         50.4958  A24         S
869 0     345777            9.5000              S
870 1     347742           11.1333              S
871 0     349248            7.8958              S
872 1     11751            52.5542  D35         S
873 0     695               5.0000  B51 B53 B55 S
874 0     345765            9.0000              S
875 0     P/PP 3381        24.0000              C
876 0     2667              7.2250              C
877 0     7534              9.8458              S
878 0     349212            7.8958              S
879 0     349217            7.8958              S
880 1     11767            83.1583  C50         C
881 1     230433           26.0000              S
882 0     349257            7.8958              S
883 0     7552             10.5167              S
884 0     C.A./SOTON 34068 10.5000              S
885 0     SOTON/OQ 392076   7.0500              S
886 5     382652           29.1250              Q
887 0     211536           13.0000              S
888 0     112053           30.0000  B42         S
889 2     W./C. 6607       23.4500              S
890 0     111369           30.0000  C148        C
891 0     370376            7.7500              Q

We can now use the same filtering methods as above to inspect the data. Here we save each successive query as a new data frame.

In [32]:
titanic %>%
  select(Pclass, Name, Sex, Fare, Age) %>%
  filter(Sex == "female") %>%
  filter(Pclass == 3) %>%
  filter(Age < 20) %>%
  arrange(Name)    # arranged data by name alphabetically

   Pclass Name                                            Sex    Fare    Age
1  3      Aks, Mrs. Sam (Leah Rosen)                      female  9.3500 18.00
2  3      Andersen-Jensen, Miss. Carla Christine Nielsine female  7.8542 19.00
3  3      Andersson, Miss. Ebba Iris Alfrida              female 31.2750  6.00
4  3      Andersson, Miss. Ellis Anna Maria               female 31.2750  2.00
5  3      Andersson, Miss. Erna Alexandra                 female  7.9250 17.00
6  3      Andersson, Miss. Ingeborg Constanzia            female 31.2750  9.00
7  3      Andersson, Miss. Sigrid Elisabeth               female 31.2750 11.00
8  3      Arnold-Franchi, Mrs. Josef (Josefine Franchi)   female 17.8000 18.00
9  3      Asplund, Miss. Lillian Gertrud                  female 31.3875  5.00
10 3      Attalah, Miss. Malake                           female 14.4583 17.00
11 3      Ayoub, Miss. Banoura                            female  7.2292 13.00
12 3      Baclini, Miss. Eugenie                          female 19.2583  0.75
13 3      Baclini, Miss. Helene Barbara                   female 19.2583  0.75
14 3      Baclini, Miss. Marie Catherine                  female 19.2583  5.00
15 3      Barbara, Miss. Saiide                           female 14.4542 18.00
16 3      Boulos, Miss. Nourelain                         female 15.2458  9.00
17 3      Carr, Miss. Helen "Ellen"                       female  7.7500 16.00
18 3      Devaney, Miss. Margaret Delia                   female  7.8792 19.00
19 3      Emanuel, Miss. Virginia Ethel                   female 12.4750  5.00
20 3      Ford, Miss. Robina Maggie "Ruby"                female 34.3750  9.00
21 3      Gilnagh, Miss. Katherine "Katie"                female  7.7333 16.00
22 3      Goodwin, Miss. Lillian Amy                      female 46.9000 16.00
23 3      Hegarty, Miss. Hanora "Nora"                    female  6.7500 18.00
24 3      Hirvonen, Miss. Hildur E                        female 12.2875  2.00
25 3      Johnson, Miss. Eleanor Ileen                    female 11.1333  1.00
26 3      Karun, Miss. Manca                              female 13.4167  4.00
27 3      Kink-Heilmann, Miss. Luise Gretchen             female 22.0250  4.00
28 3      McGowan, Miss. Anna "Annie"                     female  8.0292 15.00
29 3      Najib, Miss. Adele Kiamie "Jane"                female  7.2250 15.00
30 3      Nakid, Miss. Maria ("Mary")                     female 15.7417  1.00
31 3      Nicola-Yarred, Miss. Jamila                     female 11.2417 14.00
32 3      Palsson, Miss. Stina Viola                      female 21.0750  3.00
33 3      Palsson, Miss. Torborg Danira                   female 21.0750  8.00
34 3      Pettersson, Miss. Ellen Natalia                 female  7.7750 18.00
35 3      Sandstrom, Miss. Marguerite Rut                 female 16.7000  4.00
36 3      Sjoblom, Miss. Anna Sofia                       female  7.4958 18.00
37 3      Skoog, Miss. Mabel                              female 27.9000  9.00
38 3      Skoog, Miss. Margit Elizabeth                   female 27.9000  2.00
39 3      Strom, Miss. Telma Matilda                      female 10.4625  2.00
40 3      Turja, Miss. Anna Sofia                         female  9.8417 18.00
41 3      Van Impe, Miss. Catharina                       female 24.1500 10.00
42 3      Vander Planke, Miss. Augusta Maria              female 18.0000 18.00
43 3      Vestrom, Miss. Hulda Amanda Adolfina            female  7.8542 14.00
44 3      Yasbeck, Mrs. Antoni (Selini Alexander)         female 14.4542 15.00
45 3      Zabour, Miss. Hileni                            female 14.4542 14.50

In [33]:
df2 <- titanic %>%
  select(Pclass, Name, Sex, Fare, Age) %>%
  filter(Sex == "female") %>%
  filter(Pclass == 3) %>%
  filter(Age < 20) %>%
  arrange(Name)

df2

   Pclass Name                                            Sex    Fare    Age
1  3      Aks, Mrs. Sam (Leah Rosen)                      female  9.3500 18.00
2  3      Andersen-Jensen, Miss. Carla Christine Nielsine female  7.8542 19.00
3  3      Andersson, Miss. Ebba Iris Alfrida              female 31.2750  6.00
4  3      Andersson, Miss. Ellis Anna Maria               female 31.2750  2.00
5  3      Andersson, Miss. Erna Alexandra                 female  7.9250 17.00
6  3      Andersson, Miss. Ingeborg Constanzia            female 31.2750  9.00
7  3      Andersson, Miss. Sigrid Elisabeth               female 31.2750 11.00
8  3      Arnold-Franchi, Mrs. Josef (Josefine Franchi)   female 17.8000 18.00
9  3      Asplund, Miss. Lillian Gertrud                  female 31.3875  5.00
10 3      Attalah, Miss. Malake                           female 14.4583 17.00
11 3      Ayoub, Miss. Banoura                            female  7.2292 13.00
12 3      Baclini, Miss. Eugenie                          female 19.2583  0.75
13 3      Baclini, Miss. Helene Barbara                   female 19.2583  0.75
14 3      Baclini, Miss. Marie Catherine                  female 19.2583  5.00
15 3      Barbara, Miss. Saiide                           female 14.4542 18.00
16 3      Boulos, Miss. Nourelain                         female 15.2458  9.00
17 3      Carr, Miss. Helen "Ellen"                       female  7.7500 16.00
18 3      Devaney, Miss. Margaret Delia                   female  7.8792 19.00
19 3      Emanuel, Miss. Virginia Ethel                   female 12.4750  5.00
20 3      Ford, Miss. Robina Maggie "Ruby"                female 34.3750  9.00
21 3      Gilnagh, Miss. Katherine "Katie"                female  7.7333 16.00
22 3      Goodwin, Miss. Lillian Amy                      female 46.9000 16.00
23 3      Hegarty, Miss. Hanora "Nora"                    female  6.7500 18.00
24 3      Hirvonen, Miss. Hildur E                        female 12.2875  2.00
25 3      Johnson, Miss. Eleanor Ileen                    female 11.1333  1.00
26 3      Karun, Miss. Manca                              female 13.4167  4.00
27 3      Kink-Heilmann, Miss. Luise Gretchen             female 22.0250  4.00
28 3      McGowan, Miss. Anna "Annie"                     female  8.0292 15.00
29 3      Najib, Miss. Adele Kiamie "Jane"                female  7.2250 15.00
30 3      Nakid, Miss. Maria ("Mary")                     female 15.7417  1.00
31 3      Nicola-Yarred, Miss. Jamila                     female 11.2417 14.00
32 3      Palsson, Miss. Stina Viola                      female 21.0750  3.00
33 3      Palsson, Miss. Torborg Danira                   female 21.0750  8.00
34 3      Pettersson, Miss. Ellen Natalia                 female  7.7750 18.00
35 3      Sandstrom, Miss. Marguerite Rut                 female 16.7000  4.00
36 3      Sjoblom, Miss. Anna Sofia                       female  7.4958 18.00
37 3      Skoog, Miss. Mabel                              female 27.9000  9.00
38 3      Skoog, Miss. Margit Elizabeth                   female 27.9000  2.00
39 3      Strom, Miss. Telma Matilda                      female 10.4625  2.00
40 3      Turja, Miss. Anna Sofia                         female  9.8417 18.00
41 3      Van Impe, Miss. Catharina                       female 24.1500 10.00
42 3      Vander Planke, Miss. Augusta Maria              female 18.0000 18.00
43 3      Vestrom, Miss. Hulda Amanda Adolfina            female  7.8542 14.00
44 3      Yasbeck, Mrs. Antoni (Selini Alexander)         female 14.4542 15.00
45 3      Zabour, Miss. Hileni                            female 14.4542 14.50

Or we can explore one of the built-in data sets from R. In this case let's use the `starwars` data set.

In [34]:
data()     # can see many different data types that I can use to play around with

In [35]:
?starwars     # this gives information about the data set

In [36]:
str(starwars)    # gives the structure

tibble [87 × 14] (S3: tbl_df/tbl/data.frame)
 $ name      : chr [1:87] "Luke Skywalker" "C-3PO" "R2-D2" "Darth Vader" ...
 $ height    : int [1:87] 172 167 96 202 150 178 165 97 183 182 ...
 $ mass      : num [1:87] 77 75 32 136 49 120 75 32 84 77 ...
 $ hair_color: chr [1:87] "blond" NA NA "none" ...
 $ skin_color: chr [1:87] "fair" "gold" "white, blue" "white" ...
 $ eye_color : chr [1:87] "blue" "yellow" "red" "yellow" ...
 $ birth_year: num [1:87] 19 112 33 41.9 19 52 47 NA 24 57 ...
 $ sex       : chr [1:87] "male" "none" "none" "male" ...
 $ gender    : chr [1:87] "masculine" "masculine" "masculine" "masculine" ...
 $ homeworld : chr [1:87] "Tatooine" "Tatooine" "Naboo" "Tatooine" ...
 $ species   : chr [1:87] "Human" "Droid" "Droid" "Human" ...
 $ films     :List of 87
  ..$ : chr [1:5] "The Empire Strikes Back" "Revenge of the Sith" "Return of the Jedi" "A New Hope" ...
  ..$ : chr [1:6] "The Empire Strikes Back" "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith" ...
  ..$ : chr [1:7] "The Empire Strikes Back" "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith" ...
  ..$ : chr [1:4] "The Empire Strikes Back" "Revenge of the Sith" "Return of the Jedi" "A New Hope"
  ..$ : chr [1:5] "The Empire Strikes Back" "Revenge of the Sith" "Return of the Jedi" "A New Hope" ...
  ..$ : chr [1:3] "Attack of the Clones" "Revenge of the Sith" "A New Hope"
  ..$ : chr [1:3] "Attack of the Clones" "Revenge of the Sith" "A New Hope"
  ..$ : chr "A New Hope"
  ..$ : chr "A New Hope"
  ..$ : chr [1:6] "The Empire Strikes Back" "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith" ...
  ..$ : chr [1:3] "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith"
  ..$ : chr [1:2] "Revenge of the Sith" "A New Hope"
  ..$ : chr [1:5] "The Empire Strikes Back" "Revenge of the Sith" "Return of the Jedi" "A New Hope" ...
  ..$ : chr [1:4] "The Empire Strikes Back" "Return of the Jedi" "A New Hope" "The Force Awakens"
  ..$ : chr "A New Hope"
  ..$ : chr [1:3] "The Phantom Menace" "Return of the Jedi" "A New Hope"
  ..$ : chr [1:3] "The Empire Strikes Back" "Return of the Jedi" "A New Hope"
  ..$ : chr "A New Hope"
  ..$ : chr [1:5] "The Empire Strikes Back" "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith" ...
  ..$ : chr [1:5] "The Empire Strikes Back" "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith" ...
  ..$ : chr [1:3] "The Empire Strikes Back" "Attack of the Clones" "Return of the Jedi"
  ..$ : chr "The Empire Strikes Back"
  ..$ : chr "The Empire Strikes Back"
  ..$ : chr [1:2] "The Empire Strikes Back" "Return of the Jedi"
  ..$ : chr "The Empire Strikes Back"
  ..$ : chr [1:2] "Return of the Jedi" "The Force Awakens"
  ..$ : chr "Return of the Jedi"
  ..$ : chr "Return of the Jedi"
  ..$ : chr "Return of the Jedi"
  ..$ : chr "Return of the Jedi"
  ..$ : chr "The Phantom Menace"
  ..$ : chr [1:3] "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith"
  ..$ : chr "The Phantom Menace"
  ..$ : chr [1:2] "Attack of the Clones" "The Phantom Menace"
  ..$ : chr "The Phantom Menace"
  ..$ : chr "The Phantom Menace"
  ..$ : chr "The Phantom Menace"
  ..$ : chr [1:2] "Attack of the Clones" "The Phantom Menace"
  ..$ : chr "The Phantom Menace"
  ..$ : chr "The Phantom Menace"
  ..$ : chr [1:2] "Attack of the Clones" "The Phantom Menace"
  ..$ : chr "The Phantom Menace"
  ..$ : chr "Return of the Jedi"
  ..$ : chr [1:3] "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith"
  ..$ : chr "The Phantom Menace"
  ..$ : chr "The Phantom Menace"
  ..$ : chr "The Phantom Menace"
  ..$ : chr [1:3] "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith"
  ..$ : chr [1:3] "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith"
  ..$ : chr [1:3] "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith"
  ..$ : chr [1:2] "The Phantom Menace" "Revenge of the Sith"
  ..$ : chr [1:2] "The Phantom Menace" "Revenge of the Sith"
  ..$ : chr [1:2] "The Phantom Menace" "Revenge of the Sith"
  ..$ : chr "The Phantom Menace"
  ..$ : chr [1:3] "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith"
  ..$ : chr [1:2] "Attack of the Clones" "The Phantom Menace"
  ..$ : chr "Attack of the Clones"
  ..$ : chr "Attack of the Clones"
  ..$ : chr "Attack of the Clones"
  ..$ : chr [1:2] "Attack of the Clones" "Revenge of the Sith"
  ..$ : chr [1:2] "Attack of the Clones" "Revenge of the Sith"
  ..$ : chr "Attack of the Clones"
  ..$ : chr "Attack of the Clones"
  ..$ : chr [1:2] "Attack of the Clones" "Revenge of the Sith"
  ..$ : chr [1:2] "Attack of the Clones" "Revenge of the Sith"
  ..$ : chr "Attack of the Clones"
  ..$ : chr "Attack of the Clones"
  ..$ : chr "Attack of the Clones"
  ..$ : chr "Attack of the Clones"
  ..$ : chr "Attack of the Clones"
  ..$ : chr "Attack of the Clones"
  ..$ : chr "The Phantom Menace"
  ..$ : chr [1:2] "Attack of the Clones" "Revenge of the Sith"
  ..$ : chr "Attack of the Clones"
  ..$ : chr "Attack of the Clones"
  ..$ : chr [1:2] "Attack of the Clones" "Revenge of the Sith"
  ..$ : chr "Revenge of the Sith"
  ..$ : chr "Revenge of the Sith"
  ..$ : chr [1:2] "Revenge of the Sith" "A New Hope"
  ..$ : chr [1:2] "Attack of the Clones" "Revenge of the Sith"
  ..$ : chr "Revenge of the Sith"
  ..$ : chr "The Force Awakens"
  ..$ : chr "The Force Awakens"
  ..$ : chr "The Force Awakens"
  ..$ : chr "The Force Awakens"
  ..$ : chr "The Force Awakens"
  ..$ : chr [1:3] "Attack of the Clones" "The Phantom Menace" "Revenge of the Sith"
 $ vehicles  :List of 87
  ..$ : chr [1:2] "Snowspeeder" "Imperial Speeder Bike"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Imperial Speeder Bike"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Tribubble bongo"
  ..$ : chr [1:2] "Zephyr-G swoop bike" "XJ-6 airspeeder"
  ..$ : chr(0)
  ..$ : chr "AT-ST"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Snowspeeder"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Tribubble bongo"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Sith speeder"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Flitknot speeder"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Koro-2 Exodrive airspeeder"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Tsmeu-6 personal wheel bike"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
 $ starships :List of 87
  ..$ : chr [1:2] "X-wing" "Imperial shuttle"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "TIE Advanced x1"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "X-wing"
  ..$ : chr [1:5] "Jedi starfighter" "Trade Federation cruiser" "Naboo star skiff" "Jedi Interceptor" ...
  ..$ : chr [1:3] "Trade Federation cruiser" "Jedi Interceptor" "Naboo fighter"
  ..$ : chr(0)
  ..$ : chr [1:2] "Millennium Falcon" "Imperial shuttle"
  ..$ : chr [1:2] "Millennium Falcon" "Imperial shuttle"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "X-wing"
  ..$ : chr "X-wing"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Slave 1"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Millennium Falcon"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "A-wing"
  ..$ : chr(0)
  ..$ : chr "Millennium Falcon"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Naboo Royal Starship"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Scimitar"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Jedi starfighter"
  ..$ : chr(0)
  ..$ : chr "Naboo fighter"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "Belbullab-22 starfighter"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr "T-70 X-wing fighter"
  ..$ : chr(0)
  ..$ : chr(0)
  ..$ : chr [1:3] "H-type Nubian yacht" "Naboo star skiff" "Naboo fighter"

In [37]:
head(starwars)

  name           height mass hair_color  skin_color  eye_color birth_year
1 Luke Skywalker 172     77  blond       fair        blue       19.0
2 C-3PO          167     75  NA          gold        yellow    112.0
3 R2-D2           96     32  NA          white, blue red        33.0
4 Darth Vader    202    136  none        white       yellow     41.9
5 Leia Organa    150     49  brown       light       brown      19.0
6 Owen Lars      178    120  brown, grey light       blue       52.0
  sex    gender    homeworld species
1 male   masculine Tatooine  Human
2 none   masculine Tatooine  Droid
3 none   masculine Naboo     Droid
4 male   masculine Tatooine  Human
5 female feminine  Alderaan  Human
6 male   masculine Tatooine  Human
  films
1 The Empire Strikes Back, Revenge of the Sith    , Return of the Jedi     , A New Hope             , The Force Awakens
2 The Empire Strikes Back, Attack of the Clones   , The Phantom Menace     , Revenge of the Sith    , Return of the Jedi     , A New Hope
3 The Empire Strikes Back, Attack of the Clones   , The Phantom Menace     , Revenge of the Sith    , Return of the Jedi     , A New Hope             , The Force Awakens
4 The Empire Strikes Back, Revenge of the Sith    , Return of the Jedi     , A New Hope
5 The Empire Strikes Back, Revenge of the Sith    , Return of the Jedi     , A New Hope             , The Force Awakens
6 Attack of the Clones, Revenge of the Sith , A New Hope
  vehicles
1 Snowspeeder          , Imperial Speeder Bike
2
3
4
5 Imperial Speeder Bike
6
  starships
1 X-wing          , Imperial shuttle
2
3
4 TIE Advanced x1
5
6

In [38]:
starwars %>%      # and-then
  select(gender, mass, height, species) %>%
  filter(species == "Human") %>%
  na.omit()

   gender    mass  height species
1  masculine  77.0 172    Human
2  masculine 136.0 202    Human
3  feminine   49.0 150    Human
4  masculine 120.0 178    Human
5  feminine   75.0 165    Human
6  masculine  84.0 183    Human
7  masculine  77.0 182    Human
8  masculine  84.0 188    Human
9  masculine  80.0 180    Human
10 masculine  77.0 170    Human
11 masculine 110.0 180    Human
12 masculine  75.0 170    Human
13 masculine  78.2 183    Human
14 masculine  79.0 177    Human
15 masculine  79.0 175    Human
16 masculine  89.0 193    Human
17 masculine  84.0 188    Human
18 masculine  85.0 185    Human
19 masculine  80.0 193    Human
20 masculine  79.0 183    Human
21 masculine  79.0 188    Human
22 feminine   45.0 165    Human

In [39]:
starwars %>%      # and-then
  select(gender, mass, height, species) %>%
  filter(species == "Human") %>%
  na.omit() %>%
  mutate(height = height / 100) %>%
  mutate(BMI = mass / height^2) %>%
  group_by(gender) %>%
  summarise(Average_BMI = mean(BMI))

  gender    Average_BMI
1 feminine  21.95164
2 masculine 26.04427

Finally, we can explore the `msleep` (Mammal Sleep) sample data set using `tidyverse`.

In [40]:
my_data <- msleep %>%
  select(name, order, bodywt, sleep_total) %>%
  filter(order == "Primates", bodywt > 20) %>%
  arrange(bodywt)

my_data

  name       order    bodywt sleep_total
1 Baboon     Primates 25.235 9.4
2 Chimpanzee Primates 52.200 9.7
3 Human      Primates 62.000 8.0

## Extract a **Column** into a Vector

To extract a column of attributes back into a vector, call it out by appending `$ColName` to the data frame.

In [41]:
# assign into a var
albums_extracted <- df$Album
albums_extracted

 [1] "The Low End Theory"    "Nevermind"             "Port of Morrow"
 [4] "Dark Side of the Moon" "Naked"                 "OK Computer"
 [7] "Abbey Road"            "Thriller"              "Rumours"
[10] "The Joshua Tree"